
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СгенерироватьПаролиУчастникам();
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.Участники"));
	
	ПоказатьОповещениеПользователя(
		"Пароли созданы",
		"e1cib/list/РегистрСведений.Участники", 
		"Открыть список");
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьПаролиУчастникам()

	ВыборкаУчастников = РегистрыСведений.Участники.Выбрать();
	
	Пока ВыборкаУчастников.Следующий() Цикл
		
		Запись = ВыборкаУчастников.ПолучитьМенеджерЗаписи();
		Запись.Пароль = РегистрыСведений.Участники.НовыйПароль();
		Запись.Записать();
		
	КонецЦикла;
	 
КонецПроцедуры