
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СброситьПаролиУчастникам();
	
	ПоказатьОповещениеПользователя(
		"Пароли сброшены",
		"e1cib/list/РегистрСведений.Участники", 
		"Открыть список");
	
КонецПроцедуры

&НаСервере
Процедура СброситьПаролиУчастникам()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Участники.Участник КАК Участник,
		|	Участники.Участник.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.Участники КАК Участники
		|ГДЕ
		|	Участники.Инкогнито = ЛОЖЬ";
		
	ВыборкаУчастников = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаУчастников.Следующий() Цикл
		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ВыборкаУчастников.Идентификатор);
		Пользователь.Пароль = "";
		Пользователь.Записать();
		
	КонецЦикла;
	
КонецПроцедуры