
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СброситьПаролиУчастникам();
	
	ПоказатьОповещениеПользователя(
		"Пароли сброшены",
		"e1cib/list/РегистрСведений.Участники", 
		"Открыть список");
	
КонецПроцедуры

&НаСервере
Процедура СброситьПаролиУчастникам()

	ВыборкаУчастников = РегистрыСведений.Участники.Выбрать();
	
	Пока ВыборкаУчастников.Следующий() Цикл
		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ВыборкаУчастников.ИдентификаторПользователя);
		Пользователь.Пароль = "";
		Пользователь.Записать();
		
	КонецЦикла;
	
КонецПроцедуры