
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВариантыОтветовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.Корректный = Ложь;
		Элемент.ТекущиеДанные.Открытый = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовКорректныйПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВариантыОтветов.ТекущиеДанные;
	Для Каждого ВариантОтвета Из Объект.ВариантыОтветов Цикл
		Если ВариантОтвета.Корректный И ВариантОтвета <> ТекущаяСтрока Тогда
			ВариантОтвета.Корректный = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовОткрытыйПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВариантыОтветов.ТекущиеДанные;
	Для Каждого ВариантОтвета Из Объект.ВариантыОтветов Цикл
		Если ВариантОтвета.Открытый И ВариантОтвета <> ТекущаяСтрока Тогда
			ВариантОтвета.Открытый = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти