
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СписокВыбора = Элементы.Пользователь.СписокВыбора;
	СписокВыбора.Очистить();
	
	Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		
		Значение = Строка(ПользовательИБ.УникальныйИдентификатор);
		Представление = ПользовательИБ.Имя;
		
		СписокВыбора.Добавить(Значение, Представление);		
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Запись.ИдентификаторПользователя) Тогда
		Пользователь = Строка(Запись.ИдентификаторПользователя);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Запись.ИдентификаторПользователя = Новый УникальныйИдентификатор(Пользователь);
		Запись.ИмяПользователя = Элементы.Пользователь.СписокВыбора.НайтиПоЗначению(Пользователь).Представление;
	Иначе
		Запись.ИдентификаторПользователя = Неопределено;
		Запись.ИмяПользователя = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти