
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НачатьВводВремени();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВремяОтведенноеНаТест()
	Возврат Константы.ВремяОтведенноеНаТест.Получить();
КонецФункции

&НаСервере
Процедура УстановитьВремяОтведенноеНаТест(Знач Значение)
	Константы.ВремяОтведенноеНаТест.Установить(Значение);
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводВремени()
	
	Результат = ПолучитьВремяОтведенноеНаТест();
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьВводВремени", ЭтотОбъект);
	
	ПоказатьВводЧисла(Обработчик, Результат, "Время тестирования, мин.", 10, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводВремени(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		УстановитьВремяОтведенноеНаТест(Результат);
	КонецЕсли;
	
КонецПроцедуры