
Функция НайтиСоздатьПользователя(ПользовательИБ) Экспорт
	
	ПользовательСсылка = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", ПользовательИБ.УникальныйИдентификатор);
	
	Если Не ЗначениеЗаполнено(ПользовательСсылка) Тогда
		
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.ИмяДляВхода = ПользовательИБ.Имя;
		ПользовательОбъект.Наименование = ПользовательИБ.ПолноеИмя;
		ПользовательОбъект.Идентификатор = ПользовательИБ.УникальныйИдентификатор;
		ПользовательОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДанныеПользователяИБ");
		ПользовательОбъект.Записать();
		
		ПользовательСсылка = ПользовательОбъект.Ссылка;
		
	КонецЕсли;
		
	Возврат ПользовательСсылка;
	
КонецФункции