
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокументРезультат = ПечатьПаролей();
	
	ДокументРезультат.Показать("Пароли участников");
	
КонецПроцедуры

&НаСервере
Функция ПечатьПаролей()
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ДокументРезультат.Область(, 1, , 1).ШиринаКолонки = 25;
	ДокументРезультат.Область(, 2, , 2).ШиринаКолонки = 10;
	
	НомерСтроки = 0;
	
	ВыборкаУчастников = РегистрыСведений.Участники.Выбрать();
	
	Пока ВыборкаУчастников.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		ДокументРезультат.Область(НомерСтроки, 1).Текст = ВыборкаУчастников.ИмяПользователя;
		ДокументРезультат.Область(НомерСтроки, 2).Текст = ВыборкаУчастников.Пароль;
		
	КонецЦикла;
	
	Возврат ДокументРезультат;
	
КонецФункции